app/views/cribs/index.jbuilder

	 		json.owner do
	 			json.name	crib.owner.firstname
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT 1  [["id", 1]]