app/controllers/cribs_controller.rb

  def index
  	@cribs = Crib.all
---
SELECT "cribs".* FROM "cribs"  ORDER BY "cribs"."id" DESC

  def show
  	@crib  = Crib.find(params[:id])
---
SELECT  "cribs".* FROM "cribs" WHERE "cribs"."id" = ? LIMIT 1  [["id", 1]]