app/controllers/tenants_controller.rb

SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = ? LIMIT 1  [["id", 8]]
---
  def show
  	@tenant  = Tenant.find(params[:id])